<script setup lang="ts">
import { ref } from 'vue';
import { autoResize } from '../utils/TextRedactor';
const textRedactorRef = ref<string | undefined>('Таким образом консультация с широким активом представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки форм развития. Идейные соображения высшего порядка, а также укрепление и развитие структуры влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Задача организации, в особенности же реализация намеченных плановых заданий играет важную роль в формировании дальнейших направлений развития. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании существенных финансовых и административных условий.');
</script>

<template>
    <div class="auto-resize">
        <textarea v-model="textRedactorRef" @input="(e: any) => autoResize(e.target)"
            placeholder="Введите текст..."></textarea>
    </div>
</template>

<style scoped>
@import url(../styles/TextRedactor.scss);
</style>